# -*- coding: utf-8 -*-

# 数学演算子（9個）
# 正数
print("正数：+1 = " + str(+1))
# 負数
print("負数：-1 = " + str(-1))
# 加算
print("加算：11 + 22 = " + str(11 + 22))
# 減算
print("減算：33 - 22 = " + str(33 - 22))
# 乗算
print("乗算：5 * 6 = " + str(5 * 6))
# A(8)のB(2)乗
print("A(8)のB(2)乗：8 ** 2 = " + str(8 ** 2))

# 除算
print("除算：101 / 2 = " + str(101 / 2))
# 切り捨て除算（商の整数部分だけを取る）
print("切り捨て除算：109 // 100 = " , str(109 // 100))
# A(2000) を B(1999)で割った余り
print("除算の余り：2000 % 1999 = " , str(2000 % 1999))



# -----------------------------------------------------------------------------
print('テスト: ----------------------------------------------------------------------')
#　
print("除算の余り：2000 % 2001 = " , str(2000 % 2001))
#
print("除算の余り：1999 % 2000 = " , str(1999 % 2000))
print("除算の余り：2999 % 2000 = " , str(2999 % 2000))
print("除算の余り：3999 % 2000 = " , str(3999 % 2000))
